In [1]:
%ls

AdHoc code challenge.ipynb  package.json
COMMENTS.md                 plans.csv
get-pip.py                  script.js
instructions.md             silverPlans.js
node_modules/               slcsp.csv
output.csv                  test.csv
package-lock.json           zips.csv

In [80]:
import pandas as pd
import numpy as np

In [9]:
plans = pd.read_csv('plans.csv')

In [45]:
plans.filter(items=['rate', 'rate_area', 'metal_level']).head()

     rate  rate_area metal_level
0  298.62          7      Silver
1  421.43         60      Silver
2  361.69          5        Gold
3  379.97          2        Gold
4  359.75          2        Gold

In [ ]:
# match only plans with Silver label

In [137]:
rate_area_to_list_rate = plans.loc[plans['metal_level'] == 'Silver'].groupby(['state','rate_area'])['rate'].apply(list).reset_index(name = 'list_rates')

In [138]:
rate_area_to_list_rate.head()

  state  rate_area                                         list_rates
0    AK          1  [580.0, 597.0, 635.0, 664.0, 580.0, 604.0, 638.0]
1    AK          2  [651.0, 592.0, 625.0, 568.0, 622.0, 569.0, 585.0]
2    AK          3  [597.0, 546.0, 546.0, 561.0, 625.0, 600.0, 569.0]
3    AL          1   [264.84, 256.21, 271.37, 266.34, 271.77, 251.03]
4    AL          2   [323.25, 304.67, 261.66, 277.55, 321.43, 329.34]

In [ ]:
# function for second smallest value

In [ ]:
# get columns for only rate and rate_area

In [84]:
def secondSmallest(list_rate):
    if len(list_rate) < 2:
        return np.nan
    second_smallest = sorted(list(set(list_rate)))[1]
    return second_smallest

In [139]:
rate_area_to_list_rate['second_smallest_rate'] = rate_area_to_list_rate['list_rates'].apply(secondSmallest)

In [140]:
rate_area_to_list_rate.head()

,state,rate_area,list_rates,second_smallest_rate
0,AK,1,"[580.0, 597.0, 635.0, 664.0, 580.0, 604.0, 638.0]",597.00
1,AK,2,"[651.0, 592.0, 625.0, 568.0, 622.0, 569.0, 585.0]",569.00
2,AK,3,"[597.0, 546.0, 546.0, 561.0, 625.0, 600.0, 569.0]",561.00
3,AL,1,"[264.84, 256.21, 271.37, 266.34, 271.77, 251.03]",256.21
4,AL,2,"[323.25, 304.67, 261.66, 277.55, 321.43, 329.34]",277.55

In [ ]:
# get zipcode and rate_area

In [11]:
zips = pd.read_csv('zips.csv')

In [164]:
zips[['zipcode', 'state', 'rate_area']].head()

   zipcode state  rate_area
0    36749    AL         11
1    36703    AL         11
2    36003    AL         11
3    36008    AL         11
4    36006    AL         11

In [106]:
zipcode_counts = zips.zipcode.value_counts()

In [110]:
valid_zipcodes = zipcode_counts.index[zipcode_counts.eq(1)]

In [112]:
zipcode_bool = zips['zipcode'].isin(valid_zipcodes)

In [116]:
valid_zip_to_rate_area = zips[zipcode_bool]

In [8]:
zipcode_rate = pd.read_csv('slcsp.csv')

NameError: name 'pd' is not defined

In [100]:
len(zipcode_rate)

51

In [37]:
zipcode_rate.head()

   zipcode  rate
0    64148   NaN
1    67118   NaN
2    40813   NaN
3    18229   NaN
4    51012   NaN

In [2]:
%time

CPU times: user 2 µs, sys: 2 µs, total: 4 µs
Wall time: 20 µs

In [7]:
zipcode_to_rate_area = zipcode_rate.merge(valid_zip_to_rate_area, on='zipcode', how='left')

NameError: name 'zipcode_rate' is not defined

In [142]:
zipcode_to_rate_area.head()

   zipcode  rate state  county_code      name  rate_area
0    64148   NaN    MO      29095.0   Jackson        3.0
1    67118   NaN   NaN          NaN       NaN        NaN
2    40813   NaN    KY      21013.0      Bell        8.0
3    18229   NaN    PA      42025.0    Carbon        3.0
4    51012   NaN    IA      19035.0  Cherokee        3.0

In [143]:
final_table = zipcode_to_rate_area.merge(silverPlans, on=['state','rate_area'], how='left')

In [147]:
final_table.head()

,zipcode,rate,state,county_code,name,rate_area,list_rates,second_smallest_rate
0,64148,NaN,MO,29095.0,Jackson,3.0,"[290.05, 234.6, 265.82, 251.08, 351.6, 312.06,...",245.20
1,67118,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,40813,NaN,KY,21013.0,Bell,8.0,NaN,NaN
3,18229,NaN,PA,42025.0,Carbon,3.0,"[256.38, 390.55, 231.48, 234.65, 317.28, 332.7...",231.48
4,51012,NaN,IA,19035.0,Cherokee,3.0,"[374.3, 366.0, 372.45, 376.3, 365.99, 252.76, ...",252.76

In [145]:
len(final_table)

51

In [158]:
final_df = final_table[['zipcode', 'second_smallest_rate']].rename(columns={'second_smallest_rate':'rate'})

In [159]:
len(final_df)

51

In [155]:
final = final_df.rename(columns={'second_smallest_rate':'rate'})

In [160]:
final_df.to_csv('final.csv',index=False)

In [157]:
len(final)

51